org/articles/art_school.org
* Learning Miscellaneous Artsy Stuff in (Hopefully) Relatively Short Time

#+BEGIN_QUOTE
Draft: v0.1 | Posted: 09/29/2020 | Updated: 09/29/2020 | confidence of success: 10% | estimated time to completion: 12/31/2020 | importance: Medium
#+END_QUOTE


** Film

After asking some of my more knowledgeable art/photography/film friends and digging around the internet, I decided to purchase a Panasonic Lumix G7, alongside a tripod and a few other miscellaneous peripherals. Since I'll be using this to film Melee Stats content, the camera technically doesn't belong to me (and will likely be passed around as people have projects that require it) but as it stands I am the one who has an active film-based content piece in the works so I was the one who pulled the trigger to purchase it. 

The goal here is *learn to use this equipment quickly in order to be able to film documentary-style content within a short period of time*. As a result I don't need to super worry about stuff like fluid head tripods or autofocus or any of that stuff; I just need to learn to use the camera, point it at the right thing, make it look nice, and be able to effectively edit it together into something watchable. Should be achieveable!

I am going to be largely focused on working through [[https://www.youtube.com/watch?v=1-sBvBBi6MY][D4Darious's How to Learn Filmmaking FAST! - Without Film School]] video. I'm not trying to diminish the value of film school, but this video seems like a nice set of exercises to learn to use my equipment and make the type of content I'm interested in within a relatively short amount of time. 

*** General Points of Advice

**** 50/50 Rule

The general point here is to spend roughly half the time looking stuff up and the other half of the time actively practicing those things. This is hard to do and there's a lot of temptation to do only one or the other so make sure to look out for this (see: improving at melee). This also shows up later so don't forget it

**** Do Too Many Tests

Tests with every individual skill you acquire get the skill into your brain and make things easier to use later. It is hard to do a bunch of things at once for the first time, in a project that you want to be good as much as possible (trust me on this one).

**** Microfilms

The fastest way to get good at filmmaking is what D4Darious refers to as "Microfilms" which are basically one-scene short films which are almost exclusively intended as drills to practice a specific technique or idea. I will update this section later with my opinion later.

**** Do Not Choose Too Large A Project Too Fast

I've spoken about /Learning by Accumulation/ on this website before but when learning an entirely new medium it's best to accumulate in a way which doesn't completely overwhelm you 

**** Do Not Get Bogged Down Consuming Filmmaking Content Instead of Filmmaking

If you want to do something, you have to do it. You can not merely know about it. This is a skill, it is not a list of facts.

*** Curriculum

Necessary gear:
- [X] Camera
- [X] Tripod
- [ ] Sound Recorder
- [ ] Potentially, dedicated lights

**** Day 1 

- [X] Search “Framing and Composition” on YouTube; watch 3 videos twice
- [X] Take 100 Photos with your camera

***** Rule of thirds

Generally speaking, when composing and framing shots you want to place things on the boundary of thirds.

Things generally just look better when placed on the gridlines, and generally attention is easily drawn to the intersection of those gridlines. It serves as a roadmap for perception of the image in a more straightforward way.

You usually can enable these lines on your camera, and this is useful for composing good shots easily.

For landscape shots, it looks much nicer if horizons are placed along the lower or upper line, rather than the middle of the image.

The reason the rule of thirds look nice is because the resulting pictures serve as an approximation of the golden ratio, proportionally speaking.

