articles/art_school.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>art_school</title>
<!-- 2020-12-21 Mon 17:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ambi" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content">
<h1 class="title">art_school</h1>
<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Learning Miscellaneous Artsy Stuff in (Hopefully) Relatively Short Time</a>
<ul>
<li><a href="#sec-1-1">Film</a>
<ul>
<li><a href="#sec-1-1-1">General Points of Advice</a>
<ul>
<li><a href="#sec-1-1-1-1">50/50 Rule</a></li>
<li><a href="#sec-1-1-1-2">Do Too Many Tests</a></li>
<li><a href="#sec-1-1-1-3">Microfilms</a></li>
<li><a href="#sec-1-1-1-4">Do Not Choose Too Large A Project Too Fast</a></li>
<li><a href="#sec-1-1-1-5">Do Not Get Bogged Down Consuming Filmmaking Content Instead of Filmmaking</a></li>
</ul>
</li>
<li><a href="#sec-1-1-2">Curriculum</a>
<ul>
<li><a href="#sec-1-1-2-1">Day 1</a>
<ul>
<li><a href="#sec-1-1-2-1-1">Rule of thirds</a></li>
<li><a href="#sec-1-1-2-1-2">Symmetry</a></li>
<li><a href="#sec-1-1-2-1-3">Leading lines</a></li>
<li><a href="#sec-1-1-2-1-4">Headroom and lead room</a></li>
<li><a href="#sec-1-1-2-1-5">Depth</a></li>
<li><a href="#sec-1-1-2-1-6">Size equals power</a></li>
<li><a href="#sec-1-1-2-1-7">Framing within your frame</a></li>
<li><a href="#sec-1-1-2-1-8">Repeating elements</a></li>
<li><a href="#sec-1-1-2-1-9">Contrast and counterbalance</a></li>
<li><a href="#sec-1-1-2-1-10">Don’t be religious</a></li>
</ul>
</li>
<li><a href="#sec-1-1-2-2">Day 2</a></li>
<li><a href="#sec-1-1-2-3">Day 3</a>
<ul>
<li><a href="#sec-1-1-2-3-1">Three Point Lighting</a></li>
</ul>
</li>
<li><a href="#sec-1-1-2-4">Day 4</a></li>
<li><a href="#sec-1-1-2-5">Day 5</a>
<ul>
<li><a href="#sec-1-1-2-5-1">Depth of Field</a>
<ul>
<li><a href="#sec-1-1-2-5-1-1">Three ways to affect Depth of Field.</a></li>
<li><a href="#sec-1-1-2-5-1-2">Different types of shots using Depth of Field</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-1-2-6">Day 6</a>
<ul>
<li><a href="#sec-1-1-2-6-1">The Film Look</a>
<ul>
<li><a href="#sec-1-1-2-6-1-1">Camera Settings</a></li>
<li><a href="#sec-1-1-2-6-1-2">Technique</a></li>
<li><a href="#sec-1-1-2-6-1-3">Misc</a></li>
<li><a href="#sec-1-1-2-6-1-4">Limitations</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-1-2-7">Day 7</a></li>
<li><a href="#sec-1-1-2-8">Day 8</a></li>
<li><a href="#sec-1-1-2-9">Day 9</a></li>
<li><a href="#sec-1-1-2-10">Day 10</a></li>
<li><a href="#sec-1-1-2-11">Day 11</a></li>
<li><a href="#sec-1-1-2-12">Day 12</a></li>
<li><a href="#sec-1-1-2-13">Day 13</a></li>
<li><a href="#sec-1-1-2-14">Day 14</a></li>
<li><a href="#sec-1-1-2-15">Day 15</a></li>
<li><a href="#sec-1-1-2-16">Day 16</a></li>
<li><a href="#sec-1-1-2-17">Day 17</a></li>
<li><a href="#sec-1-1-2-18">Day 18</a></li>
<li><a href="#sec-1-1-2-19">Day 19</a></li>
<li><a href="#sec-1-1-2-20">Day 20</a></li>
<li><a href="#sec-1-1-2-21">Day 21</a></li>
<li><a href="#sec-1-1-2-22">Day 22</a></li>
<li><a href="#sec-1-1-2-23">Day 23</a></li>
<li><a href="#sec-1-1-2-24">Day 24</a></li>
<li><a href="#sec-1-1-2-25">Day 25</a></li>
<li><a href="#sec-1-1-2-26">Day 26</a></li>
<li><a href="#sec-1-1-2-27">Day 27</a></li>
<li><a href="#sec-1-1-2-28">Day 28</a></li>
<li><a href="#sec-1-1-2-29">Day 29</a></li>
<li><a href="#sec-1-1-2-30">Day 30</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2">Drawing</a>
<ul>
<li><a href="#sec-1-2-1">Art Supplies</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-1">
<h1 id="sec-1">Learning Miscellaneous Artsy Stuff in (Hopefully) Relatively Short Time</h1>
<div class="outline-text-1" id="text-1">
<blockquote>
<p>
Draft: v0.1 | Posted: 09/29/2020 | Updated: 09/29/2020 | confidence of success: 10% | estimated time to completion: 12/31/2020 | importance: Medium
</p>
</blockquote>
</div>


<div id="outline-container-sec-1-1" class="outline-2">
<h2 id="sec-1-1">Film</h2>
<div class="outline-text-2" id="text-1-1">
<p>
After asking some of my more knowledgeable art/photography/film friends and digging around the internet, I decided to purchase a Panasonic Lumix G7, alongside a tripod and a few other miscellaneous peripherals. Since I'll be using this to film Melee Stats content, the camera technically doesn't belong to me (and will likely be passed around as people have projects that require it) but as it stands I am the one who has an active film-based content piece in the works so I was the one who pulled the trigger to purchase it. 
</p>

<p>
The goal here is <b>learn to use this equipment quickly in order to be able to film documentary-style content within a short period of time</b>. As a result I don't need to super worry about stuff like fluid head tripods or autofocus or any of that stuff; I just need to learn to use the camera, point it at the right thing, make it look nice, and be able to effectively edit it together into something watchable. Should be achieveable!
</p>

<p>
I am going to be largely focused on working through <a href="https://www.youtube.com/watch?v=1-sBvBBi6MY">D4Darious's How to Learn Filmmaking FAST! - Without Film School</a> video. I'm not trying to diminish the value of film school, but this video seems like a nice set of exercises to learn to use my equipment and make the type of content I'm interested in within a relatively short amount of time. 
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-3">
<h3 id="sec-1-1-1">General Points of Advice</h3>
<div class="outline-text-3" id="text-1-1-1">
</div><div id="outline-container-sec-1-1-1-1" class="outline-4">
<h4 id="sec-1-1-1-1">50/50 Rule</h4>
<div class="outline-text-4" id="text-1-1-1-1">
<p>
The general point here is to spend roughly half the time looking stuff up and the other half of the time actively practicing those things. This is hard to do and there's a lot of temptation to do only one or the other so make sure to look out for this (see: improving at melee). This also shows up later so don't forget it
</p>
</div>
</div>

<div id="outline-container-sec-1-1-1-2" class="outline-4">
<h4 id="sec-1-1-1-2">Do Too Many Tests</h4>
<div class="outline-text-4" id="text-1-1-1-2">
<p>
Tests with every individual skill you acquire get the skill into your brain and make things easier to use later. It is hard to do a bunch of things at once for the first time, in a project that you want to be good as much as possible (trust me on this one).
</p>
</div>
</div>

<div id="outline-container-sec-1-1-1-3" class="outline-4">
<h4 id="sec-1-1-1-3">Microfilms</h4>
<div class="outline-text-4" id="text-1-1-1-3">
<p>
The fastest way to get good at filmmaking is what D4Darious refers to as "Microfilms" which are basically one-scene short films which are almost exclusively intended as drills to practice a specific technique or idea. I will update this section later with my opinion later.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-1-4" class="outline-4">
<h4 id="sec-1-1-1-4">Do Not Choose Too Large A Project Too Fast</h4>
<div class="outline-text-4" id="text-1-1-1-4">
<p>
I've spoken about <i>Learning by Accumulation</i> on this website before but when learning an entirely new medium it's best to accumulate in a way which doesn't completely overwhelm you 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-1-5" class="outline-4">
<h4 id="sec-1-1-1-5">Do Not Get Bogged Down Consuming Filmmaking Content Instead of Filmmaking</h4>
<div class="outline-text-4" id="text-1-1-1-5">
<p>
If you want to do something, you have to do it. You can not merely know about it. This is a skill, it is not a list of facts.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-3">
<h3 id="sec-1-1-2">Curriculum</h3>
<div class="outline-text-3" id="text-1-1-2">
<p>
Necessary gear:
</p>
<ul class="org-ul">
<li><code>[X]</code> Camera
</li>
<li><code>[X]</code> Tripod
</li>
<li><code>[&#xa0;]</code> Sound Recorder
</li>
<li><code>[&#xa0;]</code> Potentially, dedicated lights
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-2-1" class="outline-4">
<h4 id="sec-1-1-2-1">Day 1</h4>
<div class="outline-text-4" id="text-1-1-2-1">
<ul class="org-ul">
<li><code>[X]</code> Search “Framing and Composition” on YouTube; watch 3 videos twice
</li>
<li><code>[X]</code> Take 100 Photos with your camera
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-2-1-1" class="outline-5">
<h5 id="sec-1-1-2-1-1">Rule of thirds</h5>
<div class="outline-text-5" id="text-1-1-2-1-1">
<p>
Generally speaking, when composing and framing shots you want to place things on the boundary of thirds.
</p>

<p>
Things generally just look better when placed on the gridlines, and generally attention is easily drawn to the intersection of those gridlines. It serves as a roadmap for perception of the image in a more straightforward way.
</p>

<p>
You usually can enable these lines on your camera, and this is useful for composing good shots easily.
</p>

<p>
For landscape shots, it looks much nicer if horizons are placed along the lower or upper line, rather than the middle of the image.
</p>

<p>
The reason the rule of thirds look nice is because the resulting pictures serve as an approximation of the golden ratio, proportionally speaking.
</p>
</div>
</div>
