org/articles/art_school.org
***** Symmetry

Symmetrical shots are fun to look at, look nice, and are useful if you want to place something in the center of the frame. You'll generally want to do this for two, related reasons:

1. You want to clue the watcher that virtually nothing else is worth the effort to train your eye onto
2. You want to make cuts amidst chaotic action which allow the watcher to follow the action without hunting around the frame for the relevant information

This is useful for documentary style content where the subject speaks directly into the camera (i.e. tutorial videos).

Wes Anderson is famous for good use of symmetry in his films, if you want good examples.

***** Leading lines

Visible lines in the image point at your subject and tell the viewer what is important.

Useful for portrait shots, since they direct attention to the subject in a sort of visual vortex.

***** Headroom and lead room

People being cut off from frame makes image claustrophobic unless it’s a closeup to get at their eyes

Lead room facing image boundary makes shot feel uncomfortable because there’s no information about where they are facing

Good for interview style content to have lead room and the subject off to one side

Doing the opposite here is called “short sighting” and was used for example in Kings Speech to convey trappedness

***** Depth

Every shot has foreground, mid ground, background, use these to tell a story about how your subject exists in its surroundings

Lens is important here because it’s what will allow you to separate or not separate your subject from its background, and a wider angle lens will put more of the shot in focus

***** Size equals power

Large objects are usually important, small objects are insignificant, so use this to inform the shot

Far away subject can signify lost / smallness / insignificance while a mid or close shot gives them more agency

Angling down at subject makes them feel dominated, angling up makes them feel more powerful

***** Framing within your frame

Some sort of environmental subunit which reduces the size of your frame is really valuable (e.g. doorways)

***** Repeating elements

Interesting shots come from scenes where some element appears multiple times

***** Contrast and counterbalance

Having two visual elements which are opposed in some way can be useful to make a shot feel more balanced, or imbalanced in a way which directs attention in a specific way (e.g. light)

***** Don’t be religious

Sometimes these rules can be broken for contrast reasons or to deliberately make someone feel uncomfortable watching it

**** Day 2 

- [X] Take 50 more pictures practicing framing and composition, rule of thirds, etc.

**** Day 3 

- [X] Search “3-Point Lighting” on YouTube; watch 3 videos twice 
- [X] Use lights at home to replicate, take 50 photos of a subject

***** Three Point Lighting
There are three important types of lights which are used in three-point lighting, which is often referred to as "the first thing you learn about in film school"

- *Key light*: big important light for your subject, by itself it's a little dramatic since it'll cast shadows over your face
- *Fill light*: alt side light to diminish shadow contrast from your key light, called this because it "fills in" shadows, usualy not more than 50% as powerful as the key light
- *Backlight / Hair light*: separate subject from background, give halo-y effect, "filmic look"

*General Tidbits*
- If you want less intense light, you can move the light source further away
- "Hugo" movie known for super hot hair light, won award for cinematography
- "Motivated Lighting" placing insignificant light sources in frame to make the 3 point lighting (specifically, back light) look more natural, often you need to control the temperature of the back light to match the light source.
- Sometimes you can also add a background light to light up the background
- You can add or remove these lights for *specific* effects, such as making a scene more dramatic or less realistic-looking

It seems important to not use normal room light for this from my basic testing today so tomorrow I'll try it with a third light instead of two lights and a ceiling light for back light

**** Day 4

- [X] Take 50 photos practicing framing, composition, and 3-point lighting, with 20 of those photos next to a window with natural lighting

I tried this at around 6pm and honestly you need quite a lot of light from natural light source to be compelling in a photo, which is duly noted

**** Day 5

- [X] Search "Depth of Field" on youtube, watch 3 videos twice
- [ ] Take 50 pictures with the kit lens, experimenting with different focal lengths / aperture / etc (don't have to be amazing photos just mess with it)

