articles/art_school.html

<div id="outline-container-sec-1-1-2-1-2" class="outline-5">
<h5 id="sec-1-1-2-1-2">Symmetry</h5>
<div class="outline-text-5" id="text-1-1-2-1-2">
<p>
Symmetrical shots are fun to look at, look nice, and are useful if you want to place something in the center of the frame. You'll generally want to do this for two, related reasons:
</p>

<ol class="org-ol">
<li>You want to clue the watcher that virtually nothing else is worth the effort to train your eye onto
</li>
<li>You want to make cuts amidst chaotic action which allow the watcher to follow the action without hunting around the frame for the relevant information
</li>
</ol>

<p>
This is useful for documentary style content where the subject speaks directly into the camera (i.e. tutorial videos).
</p>

<p>
Wes Anderson is famous for good use of symmetry in his films, if you want good examples.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-3" class="outline-5">
<h5 id="sec-1-1-2-1-3">Leading lines</h5>
<div class="outline-text-5" id="text-1-1-2-1-3">
<p>
Visible lines in the image point at your subject and tell the viewer what is important.
</p>

<p>
Useful for portrait shots, since they direct attention to the subject in a sort of visual vortex.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-4" class="outline-5">
<h5 id="sec-1-1-2-1-4">Headroom and lead room</h5>
<div class="outline-text-5" id="text-1-1-2-1-4">
<p>
People being cut off from frame makes image claustrophobic unless it’s a closeup to get at their eyes
</p>

<p>
Lead room facing image boundary makes shot feel uncomfortable because there’s no information about where they are facing
</p>

<p>
Good for interview style content to have lead room and the subject off to one side
</p>

<p>
Doing the opposite here is called “short sighting” and was used for example in Kings Speech to convey trappedness
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-5" class="outline-5">
<h5 id="sec-1-1-2-1-5">Depth</h5>
<div class="outline-text-5" id="text-1-1-2-1-5">
<p>
Every shot has foreground, mid ground, background, use these to tell a story about how your subject exists in its surroundings
</p>

<p>
Lens is important here because it’s what will allow you to separate or not separate your subject from its background, and a wider angle lens will put more of the shot in focus
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-6" class="outline-5">
<h5 id="sec-1-1-2-1-6">Size equals power</h5>
<div class="outline-text-5" id="text-1-1-2-1-6">
<p>
Large objects are usually important, small objects are insignificant, so use this to inform the shot
</p>

<p>
Far away subject can signify lost / smallness / insignificance while a mid or close shot gives them more agency
</p>

<p>
Angling down at subject makes them feel dominated, angling up makes them feel more powerful
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-7" class="outline-5">
<h5 id="sec-1-1-2-1-7">Framing within your frame</h5>
<div class="outline-text-5" id="text-1-1-2-1-7">
<p>
Some sort of environmental subunit which reduces the size of your frame is really valuable (e.g. doorways)
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-8" class="outline-5">
<h5 id="sec-1-1-2-1-8">Repeating elements</h5>
<div class="outline-text-5" id="text-1-1-2-1-8">
<p>
Interesting shots come from scenes where some element appears multiple times
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-9" class="outline-5">
<h5 id="sec-1-1-2-1-9">Contrast and counterbalance</h5>
<div class="outline-text-5" id="text-1-1-2-1-9">
<p>
Having two visual elements which are opposed in some way can be useful to make a shot feel more balanced, or imbalanced in a way which directs attention in a specific way (e.g. light)
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-1-10" class="outline-5">
<h5 id="sec-1-1-2-1-10">Don’t be religious</h5>
<div class="outline-text-5" id="text-1-1-2-1-10">
<p>
Sometimes these rules can be broken for contrast reasons or to deliberately make someone feel uncomfortable watching it
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2-2" class="outline-4">
<h4 id="sec-1-1-2-2">Day 2</h4>
<div class="outline-text-4" id="text-1-1-2-2">
<ul class="org-ul">
<li><code>[X]</code> Take 50 more pictures practicing framing and composition, rule of thirds, etc.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-3" class="outline-4">
<h4 id="sec-1-1-2-3">Day 3</h4>
<div class="outline-text-4" id="text-1-1-2-3">
<ul class="org-ul">
<li><code>[X]</code> Search “3-Point Lighting” on YouTube; watch 3 videos twice 
</li>
<li><code>[X]</code> Use lights at home to replicate, take 50 photos of a subject
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-2-3-1" class="outline-5">
<h5 id="sec-1-1-2-3-1">Three Point Lighting</h5>
<div class="outline-text-5" id="text-1-1-2-3-1">
<p>
There are three important types of lights which are used in three-point lighting, which is often referred to as "the first thing you learn about in film school"
</p>

<ul class="org-ul">
<li><b>Key light</b>: big important light for your subject, by itself it's a little dramatic since it'll cast shadows over your face
</li>
<li><b>Fill light</b>: alt side light to diminish shadow contrast from your key light, called this because it "fills in" shadows, usualy not more than 50% as powerful as the key light
</li>
<li><b>Backlight / Hair light</b>: separate subject from background, give halo-y effect, "filmic look"
</li>
</ul>

<p>
<b>General Tidbits</b>
</p>
<ul class="org-ul">
<li>If you want less intense light, you can move the light source further away
</li>
<li>"Hugo" movie known for super hot hair light, won award for cinematography
</li>
<li>"Motivated Lighting" placing insignificant light sources in frame to make the 3 point lighting (specifically, back light) look more natural, often you need to control the temperature of the back light to match the light source.
</li>
<li>Sometimes you can also add a background light to light up the background
</li>
<li>You can add or remove these lights for <b>specific</b> effects, such as making a scene more dramatic or less realistic-looking
</li>
</ul>

<p>
It seems important to not use normal room light for this from my basic testing today so tomorrow I'll try it with a third light instead of two lights and a ceiling light for back light
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2-4" class="outline-4">
<h4 id="sec-1-1-2-4">Day 4</h4>
<div class="outline-text-4" id="text-1-1-2-4">
<ul class="org-ul">
<li><code>[X]</code> Take 50 photos practicing framing, composition, and 3-point lighting, with 20 of those photos next to a window with natural lighting
</li>
</ul>

<p>
I tried this at around 6pm and honestly you need quite a lot of light from natural light source to be compelling in a photo, which is duly noted
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-5" class="outline-4">
<h4 id="sec-1-1-2-5">Day 5</h4>
<div class="outline-text-4" id="text-1-1-2-5">
<ul class="org-ul">
<li><code>[X]</code> Search "Depth of Field" on youtube, watch 3 videos twice
</li>
<li><code>[&#xa0;]</code> Take 50 pictures with the kit lens, experimenting with different focal lengths / aperture / etc (don't have to be amazing photos just mess with it)
</li>
</ul>
</div>
