org/articles/art_school.org
***** Depth of Field

Depth is the range of objects in focus in your shot.

That is, it is the distance between closest object in focus and furthest object in focus; can be narrow (focus only on an object) or this can be very wide (focus on the whole landscape). For example, if you want to shoot an interview, you might want to isolate your subject and then make the background a bit out of focus. In general, this is used to help stylize your shots the way your want them.

Please remember that F number moves in the same direction as depth of field, not aperture size (i.e. small F number, narrow depth of field, big F number, wide depth of field). Fun mnemonic for this: Imagine your camera lens shoots out a lot of F's like a laser. If you want only a small number of those f's in focus, use small F number. If you want all of them in focus, use a big F number. 

You can even use depth of field to take pictures through meshes or grates and have that obstruction vanish with proper depth of field. Wow!

You directly move this with the "A mode" in a camera, which you use when the depth of field is the most important creative element to your shot (i.e. most times; portraits and landscapes). Important to remember, huge F numbers require much slower shutter speed. Also, notably, it doesn't change in the viewfinder (because the hole would be too small for high F number). Since the hole is smaller, it takes forever for all the necessary light to get in a decent picture. Opposite side; crazy exposure might be too small f number. If you get camera shake for high F numbers, you might benefit from higher ISO.

For big big depth of field, you want to focus about a third of the way through the shot first, since otherwise you're "wasting" the fs past the center of your depth of field (think of this as "centering" your prism of focus, except it's more like the one-third point in it).

****** Three ways to affect Depth of Field.

******* Aperture

The opening in your lens; wider aperture (smaller number) = shallower depth of field, and the tighter aperture (bigger number) = wider depth of field

******* distance to subject

The closer you are, the shallower the depth of field
the further you are, the wider the depth of field

******* focal length

Longer focal length = shallower depth of field
This usually matters if you have a longer lens and a shorter lens

****** Different types of shots using Depth of Field

******* Deep Focus

When the subject and background are both in focus (wide)

Gives more information to the viewer, allows information happening on multiple planes

Useful for layered 

******* Shallow Focus

Renders a portion of the image more important than the rest, the "plane of focus", which can be background, foreground, both, etc.

Used for Bokeh effect. 

Most shots use some degree of shallow focus, to draw attention to a subject. Useful to save when it really matters.

******* Soft Focus

i.e. nothing in focus, nothing is 100% sharp. Done with diffusion filters. or built-in imperfections (e.g. smear lens with vaseline)

used to lend atmosphere to dream sequences, or just surrealism in general. Generally very bold to go for this.

******* Rack Focus

A verb, not an adjective; used to move focus from one part of the shot to another part of the shot (e.g. move focus in and out of foreground / background)

"follow focus"?

******* Split Diopter

two separate focal points with medium out of focus spot

Done with specialized lenses, which are used rarely (looks a bit unnatural because human eyes cannot do it)

******* Tilt Shift

aka swing shift, which focuses an extremely narrow part of the frame.

Occasionally when zoomed out this can make actual shots look like miniatures.

**** Day 6

- [X] Search "How to get the Film look" on youtube, watch 3 videos twice
- [X] Pick up camera and record 2-minute clip of anything, with those settings

***** The Film Look

Apparently this is a specific subclass of looks that can be had, which I guess makes sense.

****** Camera Settings

Everything Manual Mode

24 fps unless you plan on slowing down footage, higher framerates look "too smooth", with "soap opera feel". This is just what "film" looks like. 

Shutter speed should be set to 1/48th of a second for 24 fps, cinematic motion blur. Faster shutter speed reduces motion blur (makes things feel jittery), Slower shutter speed adds extra motion blur. Adjusting this is useful sometimes for conveying specific feelings, such as chaos in saving private ryan's opening scene. 

180 degree shutter rule: double framerate to get shutter speed default.

ISO adjust sensitivity to light; higher, means more sensitive to light

outside: 100-200 usually
inside: 800 probably
too high you get digital noise
sometimes if your f number is too low then even 100 is too high, and you have to a smaller aperture opening to not overexpose the shot

dyanmic range: distance between brightest and darkest parts of the image, usually this is pretty hard for cameras 

useful to shoot shaded vs shaded, light vs lights etc

picture styles: Neutral style usually best if you plan to color grade in post, otherwise these are nice to have

Do not use autofocus, disable it if it is on your lens.

