articles/art_school.html

<div id="outline-container-sec-1-1-2-5-1" class="outline-5">
<h5 id="sec-1-1-2-5-1">Depth of Field</h5>
<div class="outline-text-5" id="text-1-1-2-5-1">
<p>
Depth is the range of objects in focus in your shot.
</p>

<p>
That is, it is the distance between closest object in focus and furthest object in focus; can be narrow (focus only on an object) or this can be very wide (focus on the whole landscape). For example, if you want to shoot an interview, you might want to isolate your subject and then make the background a bit out of focus. In general, this is used to help stylize your shots the way your want them.
</p>

<p>
Please remember that F number moves in the same direction as depth of field, not aperture size (i.e. small F number, narrow depth of field, big F number, wide depth of field). Fun mnemonic for this: Imagine your camera lens shoots out a lot of F's like a laser. If you want only a small number of those f's in focus, use small F number. If you want all of them in focus, use a big F number. 
</p>

<p>
You can even use depth of field to take pictures through meshes or grates and have that obstruction vanish with proper depth of field. Wow!
</p>

<p>
You directly move this with the "A mode" in a camera, which you use when the depth of field is the most important creative element to your shot (i.e. most times; portraits and landscapes). Important to remember, huge F numbers require much slower shutter speed. Also, notably, it doesn't change in the viewfinder (because the hole would be too small for high F number). Since the hole is smaller, it takes forever for all the necessary light to get in a decent picture. Opposite side; crazy exposure might be too small f number. If you get camera shake for high F numbers, you might benefit from higher ISO.
</p>

<p>
For big big depth of field, you want to focus about a third of the way through the shot first, since otherwise you're "wasting" the fs past the center of your depth of field (think of this as "centering" your prism of focus, except it's more like the one-third point in it).
</p>
</div>

<div id="outline-container-sec-1-1-2-5-1-1" class="outline-6">
<h6 id="sec-1-1-2-5-1-1">Three ways to affect Depth of Field.</h6>
<div class="outline-text-6" id="text-1-1-2-5-1-1">
</div><ul class="org-ul"><li><a id="sec-1-1-2-5-1-1-1" name="sec-1-1-2-5-1-1-1"></a>Aperture<br  /><div class="outline-text-7" id="text-1-1-2-5-1-1-1">
<p>
The opening in your lens; wider aperture (smaller number) = shallower depth of field, and the tighter aperture (bigger number) = wider depth of field
</p>
</div>
</li>

<li><a id="sec-1-1-2-5-1-1-2" name="sec-1-1-2-5-1-1-2"></a>distance to subject<br  /><div class="outline-text-7" id="text-1-1-2-5-1-1-2">
<p>
The closer you are, the shallower the depth of field
the further you are, the wider the depth of field
</p>
</div>
</li>

<li><a id="sec-1-1-2-5-1-1-3" name="sec-1-1-2-5-1-1-3"></a>focal length<br  /><div class="outline-text-7" id="text-1-1-2-5-1-1-3">
<p>
Longer focal length = shallower depth of field
This usually matters if you have a longer lens and a shorter lens
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-1-2-5-1-2" class="outline-6">
<h6 id="sec-1-1-2-5-1-2">Different types of shots using Depth of Field</h6>
<div class="outline-text-6" id="text-1-1-2-5-1-2">
</div><ul class="org-ul"><li><a id="sec-1-1-2-5-1-2-1" name="sec-1-1-2-5-1-2-1"></a>Deep Focus<br  /><div class="outline-text-7" id="text-1-1-2-5-1-2-1">
<p>
When the subject and background are both in focus (wide)
</p>

<p>
Gives more information to the viewer, allows information happening on multiple planes
</p>

<p>
Useful for layered 
</p>
</div>
</li>

<li><a id="sec-1-1-2-5-1-2-2" name="sec-1-1-2-5-1-2-2"></a>Shallow Focus<br  /><div class="outline-text-7" id="text-1-1-2-5-1-2-2">
<p>
Renders a portion of the image more important than the rest, the "plane of focus", which can be background, foreground, both, etc.
</p>

<p>
Used for Bokeh effect. 
</p>

<p>
Most shots use some degree of shallow focus, to draw attention to a subject. Useful to save when it really matters.
</p>
</div>
</li>

<li><a id="sec-1-1-2-5-1-2-3" name="sec-1-1-2-5-1-2-3"></a>Soft Focus<br  /><div class="outline-text-7" id="text-1-1-2-5-1-2-3">
<p>
i.e. nothing in focus, nothing is 100% sharp. Done with diffusion filters. or built-in imperfections (e.g. smear lens with vaseline)
</p>

<p>
used to lend atmosphere to dream sequences, or just surrealism in general. Generally very bold to go for this.
</p>
</div>
</li>

<li><a id="sec-1-1-2-5-1-2-4" name="sec-1-1-2-5-1-2-4"></a>Rack Focus<br  /><div class="outline-text-7" id="text-1-1-2-5-1-2-4">
<p>
A verb, not an adjective; used to move focus from one part of the shot to another part of the shot (e.g. move focus in and out of foreground / background)
</p>

<p>
"follow focus"?
</p>
</div>
</li>

<li><a id="sec-1-1-2-5-1-2-5" name="sec-1-1-2-5-1-2-5"></a>Split Diopter<br  /><div class="outline-text-7" id="text-1-1-2-5-1-2-5">
<p>
two separate focal points with medium out of focus spot
</p>

<p>
Done with specialized lenses, which are used rarely (looks a bit unnatural because human eyes cannot do it)
</p>
</div>
</li>

<li><a id="sec-1-1-2-5-1-2-6" name="sec-1-1-2-5-1-2-6"></a>Tilt Shift<br  /><div class="outline-text-7" id="text-1-1-2-5-1-2-6">
<p>
aka swing shift, which focuses an extremely narrow part of the frame.
</p>

<p>
Occasionally when zoomed out this can make actual shots look like miniatures.
</p>
</div>
</li></ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2-6" class="outline-4">
<h4 id="sec-1-1-2-6">Day 6</h4>
<div class="outline-text-4" id="text-1-1-2-6">
<ul class="org-ul">
<li><code>[X]</code> Search "How to get the Film look" on youtube, watch 3 videos twice
</li>
<li><code>[X]</code> Pick up camera and record 2-minute clip of anything, with those settings
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-2-6-1" class="outline-5">
<h5 id="sec-1-1-2-6-1">The Film Look</h5>
<div class="outline-text-5" id="text-1-1-2-6-1">
<p>
Apparently this is a specific subclass of looks that can be had, which I guess makes sense.
</p>
</div>

<div id="outline-container-sec-1-1-2-6-1-1" class="outline-6">
<h6 id="sec-1-1-2-6-1-1">Camera Settings</h6>
<div class="outline-text-6" id="text-1-1-2-6-1-1">
<p>
Everything Manual Mode
</p>

<p>
24 fps unless you plan on slowing down footage, higher framerates look "too smooth", with "soap opera feel". This is just what "film" looks like. 
</p>

<p>
Shutter speed should be set to 1/48th of a second for 24 fps, cinematic motion blur. Faster shutter speed reduces motion blur (makes things feel jittery), Slower shutter speed adds extra motion blur. Adjusting this is useful sometimes for conveying specific feelings, such as chaos in saving private ryan's opening scene. 
</p>

<p>
180 degree shutter rule: double framerate to get shutter speed default.
</p>

<p>
ISO adjust sensitivity to light; higher, means more sensitive to light
</p>

<p>
outside: 100-200 usually
inside: 800 probably
too high you get digital noise
sometimes if your f number is too low then even 100 is too high, and you have to a smaller aperture opening to not overexpose the shot
</p>

<p>
dyanmic range: distance between brightest and darkest parts of the image, usually this is pretty hard for cameras 
</p>

<p>
useful to shoot shaded vs shaded, light vs lights etc
</p>

<p>
picture styles: Neutral style usually best if you plan to color grade in post, otherwise these are nice to have
</p>

<p>
Do not use autofocus, disable it if it is on your lens.
</p>
</div>
</div>
