org/articles/art_school.org
****** Technique

usually 16:9 is the right way, but sometimes theres 2.35:1, easiest to do it with a letter box image but the best way to do it is to just adjust it in premiere sequence settings

film grain overlay makes it look nice sometimes, find a youtube video and overlay it with opacity cranked up, but its a stylistic choice

Warp Stablizer can be used to make things look more stable, like with hardware stablizers used in professional film, at the cost of some resolution. Can make the camera completely still for things that should have been done on tripods but weren't.

Color Grading makes a huge difference for changing the tone of a shot with no other changes. Common film look makes darks darker and lights brighter, but this depends on the footage and the shot (e.g. blues higher works good for sadder scenes). A three way color corrector can be used to make darks a bluer hue and highlights a warmer color, as an example for common film look.

Audio is the most important thing to not fuck up because if it sounds bad it stands out 

Good acting is imporant, second most important behind audio; mumble core is a good example of using nothing other than good acting 

Framing and composition makes things look like a film, you can deal with mediocre lighting but not mediocre framing

Film grammar is what makes things feel like they make sense, Hitchcock is one of the masters of film grammar. This just takes time and study, it's a language.

Good lighting is important to make things look good

Depth of field is good, make sure the actor isn't that close to any walls

Music is important for setting the ambiance

****** Misc

Backlighting is a good way to control the lighting during outdoor scenes with natural light

Use a lens hood if you are shooting into the sun unless you deliberately want lens flare / washed images

Sillouhettes are a stylistic choice, underlit shots are not.

Magic hour leads to beautiful lighting

Light baths look nice but are only appropriate when they are appropriate

Adding depth is good

Texture and Patterns looks great on cameras (see: every superhero)

Closeups, specifically of interesting faces, is good.

Christmas lights look nice out of focus so they come up a lot in films, but sometimes don't work out

Good transitions really punch up shots

****** Limitations

moire happens in patterns with weaker cameras

**** Day 7

- [ ] Do some camera tests, make videos playing around with shutter speed, ISO, etc in order to see what doesn't work ("do this all wrong")

**** Day 8

- [ ] Watch 3 videos twice about adobe premiere pro CC
- [ ] import 1 or 2 of your camera tests, make two edits, and render it out (don't do anything else to it)

**** Day 9

- [ ] LIGHTING EXERCISE: Tell a story using light, find 6 interesting shots that have something to do with the light, pay attention to camera settings and composition 

Something worth looking up here: "Magic Hour"

**** Day 10 

- [ ] Edit lighting exercise together, render, review, take notes on mistakes

**** Day 11

- [ ] vlog your day, pay attention to camera settings and composition

**** Day 12

- [ ] Edit the vlog together, render, take notes on mistakes

**** Day 13

- [ ] Search "types of shots" and "camera angles" on youtube, watch 3 videos twice

**** Day 14 

- [ ] Shoot a scene using this script:

Character A: Hey
Character B:  How long do we have?
Character A:  All night.
Character B:  OK.

Expect everything to suck, but use whatever meaning you want here.

I might do something silly instead of this

**** Day 15

- [ ] Cut the scene together and render, review and take notes on mistakes

**** Day 16

- [ ] Shoot the previous one-scene film again, but light with household lights, use a different room or location, and learn from previous mistakes

**** Day 17 

- [ ] Cut it together, render, review

**** Day 18

- [ ] Shoot another one-scene film focusing on framing and composition & camera settings.  Shoot the whole thing using available window light

**** Day 19  

- [ ] Cut it together, render, review

**** Day 20 

- [ ] Get a sound recorder, vlog adventures getting it, make it short and fun

**** Day 21 

- [ ] Look up how to use sound recorder on youtube, watch 3 videos twice
- [ ] Record 3 sounds around your house

**** Day 22 

- [ ] record 50 sounds with the sound recorder, play with gain, experiment with over modulating a few sounds
- [ ] import into an editing project, drop them into a timeline, crossfade between each of the clips, export

**** Day 23

- [ ] SOUND EXERCISE: record 20 sounds and try to tell a story (e.g., record morning routine)
- [ ] import sound clips, trim them down, render

**** Day 24 

- [ ] Interview a friend, pay attention to lights, make sure sound is good

This is the big day for my project :) 

**** Day 25

- [ ] Look up “How to Sync Sound” on YouTube, watch three videos twice
- [ ] Take footage of friend, dump into editing application, sync the sound with picture, cut so it flows nicely, render 

**** Day 26 

- [ ] Look up “180-degree Rule” on YouTube, watch three videos twice
- [ ] practice the above using toys as a subject

**** Day 27

- [ ] Search “How to Write a Script” on YouTube, watch three videos twice

**** Day 28 

- [ ] Write a simple two-page scene with a couple of people in one location (include conflict)

