articles/art_school.html

<div id="outline-container-sec-1-1-2-6-1-2" class="outline-6">
<h6 id="sec-1-1-2-6-1-2">Technique</h6>
<div class="outline-text-6" id="text-1-1-2-6-1-2">
<p>
usually 16:9 is the right way, but sometimes theres 2.35:1, easiest to do it with a letter box image but the best way to do it is to just adjust it in premiere sequence settings
</p>

<p>
film grain overlay makes it look nice sometimes, find a youtube video and overlay it with opacity cranked up, but its a stylistic choice
</p>

<p>
Warp Stablizer can be used to make things look more stable, like with hardware stablizers used in professional film, at the cost of some resolution. Can make the camera completely still for things that should have been done on tripods but weren't.
</p>

<p>
Color Grading makes a huge difference for changing the tone of a shot with no other changes. Common film look makes darks darker and lights brighter, but this depends on the footage and the shot (e.g. blues higher works good for sadder scenes). A three way color corrector can be used to make darks a bluer hue and highlights a warmer color, as an example for common film look.
</p>

<p>
Audio is the most important thing to not fuck up because if it sounds bad it stands out 
</p>

<p>
Good acting is imporant, second most important behind audio; mumble core is a good example of using nothing other than good acting 
</p>

<p>
Framing and composition makes things look like a film, you can deal with mediocre lighting but not mediocre framing
</p>

<p>
Film grammar is what makes things feel like they make sense, Hitchcock is one of the masters of film grammar. This just takes time and study, it's a language.
</p>

<p>
Good lighting is important to make things look good
</p>

<p>
Depth of field is good, make sure the actor isn't that close to any walls
</p>

<p>
Music is important for setting the ambiance
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-6-1-3" class="outline-6">
<h6 id="sec-1-1-2-6-1-3">Misc</h6>
<div class="outline-text-6" id="text-1-1-2-6-1-3">
<p>
Backlighting is a good way to control the lighting during outdoor scenes with natural light
</p>

<p>
Use a lens hood if you are shooting into the sun unless you deliberately want lens flare / washed images
</p>

<p>
Sillouhettes are a stylistic choice, underlit shots are not.
</p>

<p>
Magic hour leads to beautiful lighting
</p>

<p>
Light baths look nice but are only appropriate when they are appropriate
</p>

<p>
Adding depth is good
</p>

<p>
Texture and Patterns looks great on cameras (see: every superhero)
</p>

<p>
Closeups, specifically of interesting faces, is good.
</p>

<p>
Christmas lights look nice out of focus so they come up a lot in films, but sometimes don't work out
</p>

<p>
Good transitions really punch up shots
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-6-1-4" class="outline-6">
<h6 id="sec-1-1-2-6-1-4">Limitations</h6>
<div class="outline-text-6" id="text-1-1-2-6-1-4">
<p>
moire happens in patterns with weaker cameras
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2-7" class="outline-4">
<h4 id="sec-1-1-2-7">Day 7</h4>
<div class="outline-text-4" id="text-1-1-2-7">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Do some camera tests, make videos playing around with shutter speed, ISO, etc in order to see what doesn't work ("do this all wrong")
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-8" class="outline-4">
<h4 id="sec-1-1-2-8">Day 8</h4>
<div class="outline-text-4" id="text-1-1-2-8">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Watch 3 videos twice about adobe premiere pro CC
</li>
<li><code>[&#xa0;]</code> import 1 or 2 of your camera tests, make two edits, and render it out (don't do anything else to it)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-9" class="outline-4">
<h4 id="sec-1-1-2-9">Day 9</h4>
<div class="outline-text-4" id="text-1-1-2-9">
<ul class="org-ul">
<li><code>[&#xa0;]</code> LIGHTING EXERCISE: Tell a story using light, find 6 interesting shots that have something to do with the light, pay attention to camera settings and composition 
</li>
</ul>

<p>
Something worth looking up here: "Magic Hour"
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-10" class="outline-4">
<h4 id="sec-1-1-2-10">Day 10</h4>
<div class="outline-text-4" id="text-1-1-2-10">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Edit lighting exercise together, render, review, take notes on mistakes
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-11" class="outline-4">
<h4 id="sec-1-1-2-11">Day 11</h4>
<div class="outline-text-4" id="text-1-1-2-11">
<ul class="org-ul">
<li><code>[&#xa0;]</code> vlog your day, pay attention to camera settings and composition
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-12" class="outline-4">
<h4 id="sec-1-1-2-12">Day 12</h4>
<div class="outline-text-4" id="text-1-1-2-12">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Edit the vlog together, render, take notes on mistakes
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-13" class="outline-4">
<h4 id="sec-1-1-2-13">Day 13</h4>
<div class="outline-text-4" id="text-1-1-2-13">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Search "types of shots" and "camera angles" on youtube, watch 3 videos twice
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-14" class="outline-4">
<h4 id="sec-1-1-2-14">Day 14</h4>
<div class="outline-text-4" id="text-1-1-2-14">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Shoot a scene using this script:
</li>
</ul>

<p>
Character A: Hey
Character B:  How long do we have?
Character A:  All night.
Character B:  OK.
</p>

<p>
Expect everything to suck, but use whatever meaning you want here.
</p>

<p>
I might do something silly instead of this
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-15" class="outline-4">
<h4 id="sec-1-1-2-15">Day 15</h4>
<div class="outline-text-4" id="text-1-1-2-15">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Cut the scene together and render, review and take notes on mistakes
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-16" class="outline-4">
<h4 id="sec-1-1-2-16">Day 16</h4>
<div class="outline-text-4" id="text-1-1-2-16">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Shoot the previous one-scene film again, but light with household lights, use a different room or location, and learn from previous mistakes
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-17" class="outline-4">
<h4 id="sec-1-1-2-17">Day 17</h4>
<div class="outline-text-4" id="text-1-1-2-17">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Cut it together, render, review
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-18" class="outline-4">
<h4 id="sec-1-1-2-18">Day 18</h4>
<div class="outline-text-4" id="text-1-1-2-18">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Shoot another one-scene film focusing on framing and composition &amp; camera settings.  Shoot the whole thing using available window light
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-19" class="outline-4">
<h4 id="sec-1-1-2-19">Day 19</h4>
<div class="outline-text-4" id="text-1-1-2-19">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Cut it together, render, review
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-20" class="outline-4">
<h4 id="sec-1-1-2-20">Day 20</h4>
<div class="outline-text-4" id="text-1-1-2-20">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Get a sound recorder, vlog adventures getting it, make it short and fun
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-21" class="outline-4">
<h4 id="sec-1-1-2-21">Day 21</h4>
<div class="outline-text-4" id="text-1-1-2-21">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Look up how to use sound recorder on youtube, watch 3 videos twice
</li>
<li><code>[&#xa0;]</code> Record 3 sounds around your house
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-22" class="outline-4">
<h4 id="sec-1-1-2-22">Day 22</h4>
<div class="outline-text-4" id="text-1-1-2-22">
<ul class="org-ul">
<li><code>[&#xa0;]</code> record 50 sounds with the sound recorder, play with gain, experiment with over modulating a few sounds
</li>
<li><code>[&#xa0;]</code> import into an editing project, drop them into a timeline, crossfade between each of the clips, export
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-23" class="outline-4">
<h4 id="sec-1-1-2-23">Day 23</h4>
<div class="outline-text-4" id="text-1-1-2-23">
<ul class="org-ul">
<li><code>[&#xa0;]</code> SOUND EXERCISE: record 20 sounds and try to tell a story (e.g., record morning routine)
</li>
<li><code>[&#xa0;]</code> import sound clips, trim them down, render
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-24" class="outline-4">
<h4 id="sec-1-1-2-24">Day 24</h4>
<div class="outline-text-4" id="text-1-1-2-24">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Interview a friend, pay attention to lights, make sure sound is good
</li>
</ul>

<p>
This is the big day for my project :) 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2-25" class="outline-4">
<h4 id="sec-1-1-2-25">Day 25</h4>
<div class="outline-text-4" id="text-1-1-2-25">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Look up “How to Sync Sound” on YouTube, watch three videos twice
</li>
<li><code>[&#xa0;]</code> Take footage of friend, dump into editing application, sync the sound with picture, cut so it flows nicely, render 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-26" class="outline-4">
<h4 id="sec-1-1-2-26">Day 26</h4>
<div class="outline-text-4" id="text-1-1-2-26">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Look up “180-degree Rule” on YouTube, watch three videos twice
</li>
<li><code>[&#xa0;]</code> practice the above using toys as a subject
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-27" class="outline-4">
<h4 id="sec-1-1-2-27">Day 27</h4>
<div class="outline-text-4" id="text-1-1-2-27">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Search “How to Write a Script” on YouTube, watch three videos twice
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2-28" class="outline-4">
<h4 id="sec-1-1-2-28">Day 28</h4>
<div class="outline-text-4" id="text-1-1-2-28">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Write a simple two-page scene with a couple of people in one location (include conflict)
</li>
</ul>
</div>
</div>
